poiseuille/before-run/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// Dimension
xmin    0;
xmax    10;
ymin    -0.5;
ymax    0.5;
zmin    0;
zmax    0.1;

vertices
(
    ($xmin   $ymin   $zmin)      // virtex 0
    ($xmax   $ymin   $zmin)      // virtex 1
    ($xmax   $ymax   $zmin)      // virtex 2
    ($xmin   $ymax   $zmin)      // virtex 3
    ($xmin   $ymin   $zmax)      // virtex 4
    ($xmax   $ymin   $zmax)      // virtex 5
    ($xmax   $ymax   $zmax)      // virtex 6
    ($xmin   $ymax   $zmax)      // virtex 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 100 1) 
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(


    inlet
    {
        type    patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type    patch;
        faces
        (
            (2 6 5 1)
        );
    }
    topAndBottom
    {
        type    walls;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
